# DefinitionBindingMapIterator Class

---
An iterator to a parameter definition to parameter bindings map.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDefinitionBindingMapIterator
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public abstract class DefinitionBindingMapIterator : APIObject,
    	IEnumerator

    Public MustInherit Class DefinitionBindingMapIterator
    	Inherits APIObject
    	Implements IEnumerator

    public ref class DefinitionBindingMapIterator abstract : public APIObject,
    	IEnumerator

    [<AbstractClassAttribute>]
    type DefinitionBindingMapIterator =
        class
            inherit APIObject
            interface IEnumerator
        end
The DefinitionBindingMapIterator type exposes the following members.
| Name| Description
---|---|---
| DefinitionBindingMapIterator| For Internal Use Only.
Top
| Name| Description
---|---|---
| Current| Retrieves the binding that is the current focus of the iterator.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Key| Retrieves the definition that is the current focus of the iterator.
Top
| Name| Description
---|---|---
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| MoveNext| Move the iterator one item forward.
| Reset| Bring the iterator back to the start of the map.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace